---
kind: type
id: T:Autodesk.Revit.DB.DimensionSegmentArray
source: html/ea274891-53e6-efbe-6dec-fc2c32636ad2.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray

An array that can contain any number of DimensionSegment objects.

## Syntax (C#)
```csharp
public class DimensionSegmentArray : APIObject,
	IEnumerable
```